# Set global configuration arguments
cask_args appdir: "/Applications"

# Taps
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/bundle"
tap "homebrew/core"

# Cask dependencies
brew "mas"
cask "java"

# Shells
brew "bash"
brew "fish"

# CLI utilities
brew "coreutils"
brew "curl", args: ["with-nghttp2"]
brew "findutils"
brew "git"
brew "gpg"
brew "grep"
brew "openssh"
brew "rsync"
brew "ssh-copy-id"
brew "tree"
brew "wget"
brew "ntfs-3g"

# Mac OS tools
brew "duti" # Required for setting preferences
brew "tccutil" # Required for setting preferences

# Programming languages and dev tools
brew "go"
brew "kotlin"
brew "pyenv"
brew "ruby-build"
brew "rbenv"
brew "node"
brew "nvm"
brew "openjdk"
brew "maven"
brew "yarn"
brew "watchman"
brew "docker"
brew "docker-compose"
brew "awscli"
cask "iterm2"
cask "sourcetree"
cask "visual-studio-code"
cask "docker"
cask "virtualbox"
cask "postman"

# Apps
cask "bartender"
cask "iina"
cask "google-chrome"
cask "android-file-transfer"
cask "unetbootin"
cask "ultimaker-cura"
cask "spectacle"
cask "pock"
cask "istat-menus"
cask "cheatsheet"
cask "appcleaner"
cask "ccleaner"
cask "aerial"
cask "keeweb"
cask "megasync"
cask "little-snitch"
cask "nordvpn"
cask "tunnelblick"
cask "mark-text"
cask "steam"
cask "transmission"
cask "station"
cask "handbrake"
cask "imageoptim"
cask "gimp"
cask "xld"
cask "spotify"
cask "spotmenu"
cask "calibre"
