# Set global configuration arguments
cask_args appdir: "/Applications"

# Taps
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/bundle"
tap "homebrew/core"
tap "aws/tap"

# Cask dependencies
brew "mas"
cask "java"

# Shells
brew "bash"
brew "fish"

# CLI utilities
brew "coreutils"
brew "curl"
brew "findutils"
brew "git"
brew "gpg"
brew "grep"
brew "openssh"
brew "rsync"
brew "ssh-copy-id"
brew "tree"
brew "wget"
cask "osxfuse"
brew "ntfs-3g"

# Mac OS tools
brew "duti" # Required for setting preferences
brew "tccutil" # Required for setting preferences

# Programming languages and dev tools
brew "go"
brew "kotlin"
brew "pyenv"
brew "ruby-build"
brew "rbenv"
brew "node"
brew "nvm"
brew "openjdk"
brew "maven"
brew "yarn"
brew "watchman"
brew "docker"
brew "docker-compose"
brew "awscli"
brew "aws-sam-cli"
cask "iterm2"
cask "sourcetree"
cask "visual-studio-code"
cask "docker"
cask "virtualbox"
cask "insomnia"

# Apps
cask "bartender"
cask "iina"
cask "google-chrome"
# cask "android-file-transfer"
cask "unetbootin"
cask "spectacle"
# cask "pock"
cask "cheatsheet"
cask "appcleaner"
cask "ccleaner"
# cask "aerial"
cask "keeweb"
cask "megasync"
cask "little-snitch"
cask "nordvpn"
# cask "tunnelblick"
# cask "steam"
cask "transmission"
# cask "handbrake"
# cask "imageoptim"
# cask "gimp"
# cask "xld"
cask "spotify"
# cask "calibre"
cask "notion"
cask "keka"
cask "slack"
cask "balenaetcher"